# Pandas DataFrame exercises

In [110]:
import numpy as np

import pandas as pd

--------
## DataFrame creation

### Crie um DataFrame Vazio

In [111]:
df = pd.DataFrame()

In [112]:
print(df)

Empty DataFrame
Columns: []
Index: []

<img width=400 src="https://cdn.dribbble.com/users/4678/screenshots/1986600/avengers.png"></img>


### Crie um  `marvel_df` com os dados abaixo

In [113]:
marvel_data = [
    ['Spider-Man', 'male', 1962],
    ['Captain America', 'male', 1941],
    ['Wolverine', 'male', 1974],
    ['Iron Man', 'male', 1963],
    ['Thor', 'male', 1963],
    ['Thing', 'male', 1961],
    ['Mister Fantastic', 'male', 1961],
    ['Hulk', 'male', 1962],
    ['Beast', 'male', 1963],
    ['Invisible Woman', 'female', 1961],
    ['Storm', 'female', 1975],
    ['Namor', 'male', 1939],
    ['Hawkeye', 'male', 1964],
    ['Daredevil', 'male', 1964],
    ['Doctor Strange', 'male', 1963],
    ['Hank Pym', 'male', 1962],
    ['Scarlet Witch', 'female', 1964],
    ['Wasp', 'female', 1963],
    ['Black Widow', 'female', 1964],
    ['Vision', 'male', 1968]
]

In [114]:
marvel_df = pd.DataFrame(marvel_data, columns=['Name', 'Gen', 'Year'])
marvel_df

                Name     Gen  Year
0         Spider-Man    male  1962
1    Captain America    male  1941
2          Wolverine    male  1974
3           Iron Man    male  1963
4               Thor    male  1963
5              Thing    male  1961
6   Mister Fantastic    male  1961
7               Hulk    male  1962
8              Beast    male  1963
9    Invisible Woman  female  1961
10             Storm  female  1975
11             Namor    male  1939
12           Hawkeye    male  1964
13         Daredevil    male  1964
14    Doctor Strange    male  1963
15          Hank Pym    male  1962
16     Scarlet Witch  female  1964
17              Wasp  female  1963
18       Black Widow  female  1964
19            Vision    male  1968


### Adicione a coluna nomes ao DF

### Adicione o index `marvel_df` (use o nome dos personagens como index)

In [115]:
marvel_df.head()

              Name   Gen  Year
0       Spider-Man  male  1962
1  Captain America  male  1941
2        Wolverine  male  1974
3         Iron Man  male  1963
4             Thor  male  1963

In [116]:
marvel_df.set_index('Name', inplace=True)

In [117]:
marvel_df.head(2)

                  Gen  Year
Name
Spider-Man       male  1962
Captain America  male  1941

### Drop a coluna nome visto que agora ela é o index

In [118]:
marvel_df.index.name = None

In [119]:
marvel_df.head()

                  Gen  Year
Spider-Man       male  1962
Captain America  male  1941
Wolverine        male  1974
Iron Man         male  1963
Thor             male  1963


### Drop Namor e Hank Pyn

In [120]:

marvel_df.drop(['Namor', 'Hank Pym'], axis=0, inplace=True)


## DataFrame selection, slicing and indexation

### Mostre os primeiros 5 elementos do dataframe

In [121]:
marvel_df.head()

                  Gen  Year
Spider-Man       male  1962
Captain America  male  1941
Wolverine        male  1974
Iron Man         male  1963
Thor             male  1963


### Mostre os 4 últimos elementos do dataframe

In [122]:
marvel_df.tail(4)

                  Gen  Year
Scarlet Witch  female  1964
Wasp           female  1963
Black Widow    female  1964
Vision           male  1968


### Mostre somente o sexto dos 5 primeiros elementos do DF `marvel_df`

In [123]:
marvel_df.iloc[:6]

                  Gen  Year
Spider-Man       male  1962
Captain America  male  1941
Wolverine        male  1974
Iron Man         male  1963
Thor             male  1963
Thing            male  1961

In [124]:
marvel_df.loc['Thing']

Gen     male
Year    1961
Name: Thing, dtype: object


### Mostre a primeira aparição dos elementos do meio `marvel_df`

In [125]:
meio = len(marvel_df)//2
valores_meio = marvel_df.head(meio)
valores_meio.head(1)

             Gen  Year
Spider-Man  male  1962

### Mostre os primeiros e últimos elementos `marvel_df`

In [126]:
display(marvel_df.head(1), marvel_df.tail(1))

             Gen  Year
Spider-Man  male  1962

         Gen  Year
Vision  male  1968

## DataFrame manipulação e operação

### Modifique a  `first_appearance` do 'Vision' para o ano 1964

In [127]:
marvel_df.head(3)

                  Gen  Year
Spider-Man       male  1962
Captain America  male  1941
Wolverine        male  1974

In [128]:
marvel_df.loc['Vision']

Gen     male
Year    1968
Name: Vision, dtype: object

In [129]:
marvel_df['Year'].loc['Vision'] = 1964

C:\Users\Sávio\AppData\Local\Temp\ipykernel_30236\1923361832.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  marvel_df['Year'].loc['Vision'] = 1964


### Adicione uma nova coluna para o dataframe  `marvel_df` chamada   'years_since' com os anos desde  `first_appearance`

In [130]:
marvel_df['year_since'] = marvel_df['Year']
marvel_df.head(10)

                     Gen  Year  year_since
Spider-Man          male  1962        1962
Captain America     male  1941        1941
Wolverine           male  1974        1974
Iron Man            male  1963        1963
Thor                male  1963        1963
Thing               male  1961        1961
Mister Fantastic    male  1961        1961
Hulk                male  1962        1962
Beast               male  1963        1963
Invisible Woman   female  1961        1961


## DataFrame boolean arrays

### Dê ao  `marvel_df` mostrando somente os personagens femininos

In [131]:
marvel_female = marvel_df.loc[marvel_df['Gen']=='female']
marvel_female

                    Gen  Year  year_since
Invisible Woman  female  1961        1961
Storm            female  1975        1975
Scarlet Witch    female  1964        1964
Wasp             female  1963        1963
Black Widow      female  1964        1964


### Given the `marvel_df` pandas DataFrame, get the male characters

In [132]:
marvel_male = marvel_df.loc[marvel_df['Gen']=='male']
marvel_male

                   Gen  Year  year_since
Spider-Man        male  1962        1962
Captain America   male  1941        1941
Wolverine         male  1974        1974
Iron Man          male  1963        1963
Thor              male  1963        1963
Thing             male  1961        1961
Mister Fantastic  male  1961        1961
Hulk              male  1962        1962
Beast             male  1963        1963
Hawkeye           male  1964        1964
Daredevil         male  1964        1964
Doctor Strange    male  1963        1963
Vision            male  1964        1964


### Given the `marvel_df` pandas DataFrame, get the characters with `first_appearance` after 1970

In [133]:
marvel_1970 = marvel_df.loc[marvel_df['Year']>1970]
marvel_1970

              Gen  Year  year_since
Wolverine    male  1974        1974
Storm      female  1975        1975


### Given the `marvel_df` pandas DataFrame, get the female characters with `first_appearance` after 1970

In [134]:
marvel_female.loc[marvel_female['Year']>1970]

          Gen  Year  year_since
Storm  female  1975        1975

## DataFrame summary statistics

In [135]:
marvel_df.describe()

              Year   year_since
count    18.000000    18.000000
mean   1962.888889  1962.888889
std       6.720372     6.720372
min    1941.000000  1941.000000
25%    1962.000000  1962.000000
50%    1963.000000  1963.000000
75%    1964.000000  1964.000000
max    1975.000000  1975.000000